<?php

return [
	
	'title' => 'Хато',
	
	'default_title' => 'Хато',
	
	'error_for_production' => [
		'name' => 'Ички хатолик',
		'Хатолик содир этилди. Тизим администраторига хабар беришингизни сўраймиз.',
	],
	
	'php_warning' => [
		'name' => 'PHP огоҳлантириш',
	],
	
	'unknown_method' => [
		'name' => 'Ноўрин метод',
	],
	
	'php_fatal_error' => [
		'name' => 'Фатал PHP хатолик',
	],
	
	'400' => [
		'name' => 'Нотўғри сўров',
		'message' => 'Сўров синтаксиси сервер томонидан тушунилмади.',
	],
	
	'401' => [
		'name' => 'Авторизация қилинмаган сўров',
		'message' => 'Сўралган ресурс учун аутентификация талаб қилинади.',
	],
	
	'403' => [
		'name' => 'Кириш тақиқланган',
		'message' => 'Сервер сўровни тушунсада, мижозга кўрсатилган ресурсга тақиқ мавжудлиги сабабли сўровни қайта ишлашни рад этмоқда.',
	],
	
	'404' => [
		'name' => 'Саҳифа топилмади',
		'message' => 'Сервер сўралган саҳифани топа олмаяпти.',
	],
	
	'405' => [
		'name' => 'Рухсат этилмаган метод',
		'message' => 'Сўровда кўрсатилган методга рухсат берилмаган.',
	],
	
	'406' => [
		'name' => 'Ноўрин запрос',
		'message' => 'Саҳифа сўровда кўрсатилган характеристикага мувофиқ жавоб бермаяпти.',
	],
	
	'407' => [
		'name' => 'Прокси-серверда ҳақиқийликни текшириб кўриш талаб этилмоқда',
		'message' => '',
	],
	
	'408' => [
		'name' => 'Сўров учун тайм-аут',
		'message' => 'Серверда сўровни кутиш вақти тугади. Мижоз хоҳлаган пайтда аввалгисига ўхшаш сўровни такрорлаши мумкин.',
	],
	
	'409' => [
		'name' => 'Тўқнашув',
		'message' => 'Сўровни бажариш жараёнида серверда тўқнашув вужудга келди.',
	],
	
	'410' => [
		'name' => 'Ўчирилди',
		'message' => 'Сўралган ресурс обдон ўчирилди.',
	],
	
	'411' => [
		'name' => 'Параметр узунлигини кўрсатиш лозим',
		'message' => 'Сервер сўровни Content-Length сарлавҳасиз қабул килмайди.',
	],
	
	'412' => [
		'name' => 'Аввалдан белгиланган шарт бажарилмади',
		'message' => 'Жўнатувчи юборган сўровда кўрсатилган шартлардан бири серверга мос эмас.',
	],
	
	'413' => [
		'name' => 'Сўров ҳажми жуда ҳам йирик',
		'message' => 'Сервер сўровни унинг ҳажми белгилангандар ортиқча эканлиги сабабли қабул қилиш имконига эга эмас.',
	],
	
	'414' => [
		'name' => 'Сўралаётган URI ҳажми жуда йирик',
		'message' => 'Сервер томонидан қабул қилиниши учун сўралаётган URL жуда катта ҳажмга эга.',
	],
	
	'415' => [
		'name' => 'Қабул қилинмийдиган сўров тури',
		'message' => 'Саҳифа томонидан бундай сўров формати қабул қилинмайди.',
	],
	
	'416' => [
		'name' => 'Бажариб бўлмайдиган сўров диапазони',
		'message' => 'Саҳифа учун мумкин бўлмаган диапазон сўралмоқда.',
	],
	
	'417' => [
		'name' => 'Натижа кутилганчалик эмас',
		'message' => 'Сервер «Expect» сўрови сарлавҳасида кўрсатилган талабларни бажара олмайди',
	],
	
	'500' => [
		'name' => 'Сервернинг ички хатолиги',
		'message' => 'Серверда ички хатолик юзага келди ва у сўровни бажара олмайди.',
	],
	
	'501' => [
		'name' => 'Қабул қилинмайдиган метод',
		'message' => 'Сўровни қайта ишлаш учун зарур бўлган функциялар серверда мавжуд эмас.',
	],
	
	'502' => [
		'name' => 'Шлюз хатоси',
		'message' => 'Сервер ўзидан юқори турувчи сервердан шлюз ёки прокси-сервер сифатида мумкин бўлмаган жавобни олди.',
	],
	
	'503' => [
		'name' => 'Хизмат мавжуд эмас',
		'message' => 'Сервер вақтинчалик иш фаолиятида эмас. Одатда бу вақтинчалик ҳолат.',
	],
	
	'504' => [
		'name' => 'Шлюз тайм-аути',
		'message' => 'Сервер юқори турувчи сервердан шлюз ёки прокси-сервер сифатида ўз вақтида жавоб олмади.',
	],
	
	'505' => [
		'name' => 'HTTP версияси қабул қилинмайди',
		'message' => 'Сервер сўровда ишлатилаётган НТТР протоколи версиясини қабул қилмайди.',
	],
	
];
